<?php
class ErrorCodeHelper {
	private static $code = array(
		-9999 => '接口验证失败',
		-9998 => '未知错误',
		-9997 => '验证码输入有误',
		-9996 => '验证码生成频率过快',
		-9995 => '参数错误',
		
		//用户相关
		-10000 => '账号不存在',
		-10001 => '账号或密码有误',
		-10002 => '账号冻结,请联系客服人员',
		-10003 => '邮箱格式错误',
		-10004 => '邮箱已经绑定过',
		-10005 => '用户名已经存在',
		-10006 => '邮箱已经注册',
		-10007 => '手机号已经注册',
		-10008 => '手机号不能为空',
		-10009 => '请先登录',
		-10010 => '手机号格式错误',
		-10011 => '账号已经过期,请联系客服',
		-10012 => '账号已经注册',
		-10013 => '密码错误',
		-10014 => '密码不能为空',
			
		10000 => '验证码稍后发送到您的手机',
		10001 => '授权成功, 请输入手机号进行绑定',
		//用户相关
			
		//商品,购物车相关
		-40000 => '商品不存在',
		-40001 => '商品库存不足',
		-40002 => '尚未选择需要结算的商品',
		-40003 => '购物车已有该商品',
		//商品相关
		
		//商户相关
		-50000 => '店铺不存在',
		//商户相关
			
		//订单时间相关
			
		0 => '参数错误',	
		1 => '操作成功',
		2 => '操作成功, 请完善贵公司的资料已便于我们尽快通过审核',
		3 => '审核成功',
		4 => '注册成功,我们将尽快对您的帐户进行审核,感谢您的使用',
		5 => '删除成功'
	);

	/**
	 * 获取错误信息
	 * @author shezz
	 * @date 2014-8-18
	 */
	public static function getError($code) {
		if ( isset(self::$code[$code]) ) {
			return self::$code[$code];
		}
		return $code;
	}
	
	/**
	 * 判断错误码是否定义
	 * @author shezz
	 * @date 2014-8-18
	 */
	public static function isDefined($code) {
		if ( is_numeric($code) && isset(self::$code[$code]) ) {
			return true;
		}
		return false;
	}
}